import React, { Component } from 'react';
import Modal from 'react-awesome-modal';
import CustomButton from '../../custombutton/custombutton.component';

import './Modal-asab.styles.scss';

export default class ModalAsab extends Component {
    constructor(props) {
        super(props);
        this.state = {
            visible : false
        }
    }

    openModal() {
        this.setState({
            visible : true
        });
    }

    closeModal() {
        this.setState({
            visible : false
        });
    }

    render() {
        return (
            <div>
                <CustomButton className='buttonmodal' onClick={() => this.openModal()} >توضیحات بیشتر</CustomButton>
                <Modal visible={this.state.visible} width="1500" height="800" effect="fadeInUp" onClickAway={() => this.closeModal()}>
                    <div className='paracontainer'>
                        <h3>عصب کشی</h3>
                        <p className='paramodal'>
توصیه های قبل از انجام عصب‌کشی دندان
عصب‌کشی دندان یک درمان به‌ظاهر پراسترس برای مراجعین است. درحالی‌که در واقعیت، این درمان یکی از کم‌عارضه‌ترین درمان‌ها برای نگهداری و جلوگیری از کشیده شدن دندان‌های شماست که تحت بی‌حسی موضعی و با کمترین اذیت انجام می‌شود. در عصب‌کشی بعد از بی‌حسی پوسیدگی دندان شما با تراش خارج می‌شود. سپس دسترسی به پالپ (عصب) دندان از طریق تاج دندان فراهم می‌شود. کانال یا کانال‌های دندان که حاوی عروق، اعصاب و … هستند، پاکسازی می‌شوند و بعد فضایی در داخل کانال با آماده‌سازی و شست‌وشوی مکرر فراهم می‌شود. سپس با مواد مخصوصی این فضای داخل ریشه‌های دندان پر می‌شود. گاهی این پروسه که به‌اختصار ذکر شد نیاز است که در دو یا حتی چند جلسه انجام شود. بعد از تمام شدن درمان ریشه (عصب‌کشی) دندان برای پرشدن و یا روکش شدن آماده است. بعد از درمان درجاتی از درد طبیعی است که می‌توانید در مورد چگونگی مواجهه با آن به توصیه‌های بعد از درمان ریشه مراجعه کنید با رعایت موارد زیر قبل از درمان ریشه، می‌توانید درمان به‌مراتب راحت‌تر و خوشایندتری داشته باشید.
1. قبل از همه چیز تمام پیش‌فرض‌ها و تصوراتی را که در مورد عصب‌کشی دارید دور بریزید! حتی اگر تجربه قبلی درمان ریشه (عصب‌کشی) ناخوشایندی داشته‌اید، ضمن اینکه آن را با دندانپزشک خود مطرح می‌کنید، فراموش کنید! .عصب‌کشی برخلاف تصور اولیه خیلی از مراجعین، درمانی ملایم و با کمترین درد و اذیت است.
2. لباس راحت بپوشید. درمان ریشه شما ممکن است طولانی باشد. از پوشیدن لباس‌های مهمانی و گران‌قیمت خودداری کنید. در درمان ریشه از هیپوکلریت استفاده می‌شود و یک قطره از این ماده اگر ناخواسته بر روی لباس شما بچکد، آن را خراب خواهد کرد. 
3. سؤالات خود را از دندانپزشکتان بپرسید. در مورد تمام دغدغه‌ها و نگرانی‌هایتان سؤال کنید. بعضی‌ها از آمپول بی‌حسی وحشت دارند. برخی از بی‌حس نشدن، جمع شدن آب در دهان، حس خفگی، درد حین کار، خستگی، دررفتن فک و … می‌ترسند. همه این‌ها را به ما بگویید. ما مشکلاتی که ممکن است شما با دندانپزشکی داشته باشید را می‌دانیم، درک می‌کنیم و برای رفع آن‌ها، حداکثر تلاش خود را صورت می‌دهیم.در مورد که درمان چند جلسه است و چه قدر طول می کشد با دندانپزشک خود صحبت کنید. 
4. این نکته بیشتر برای خانم‌ها دلالت می‌کند. برای حضور در مطب دندانپزشکی زحمت آرایش غلیظ به خود ندهید. از رژ لب استفاده نکنید و موهای خود را پشت نبندید و گیره یا کلیپس خود را خارج کنید تا سرتان در یونیت در موقعیت صحیح قرار بگیرد و اذیت نشوید.
5. برای انجام عصب‌کشی هیچ‌کدام از داروهایی که پزشک برای شما تجویز کرده است نیاز نیست قطع کنید. اگر باردار هستید، مشکل فشارخون، مشکل قلبی به‌خصوص سابقه جراحی قلب و یا مشکلات پزشکی دیگر دارید ممکن است نیاز باشد که با پزشک خود قبل از مراجعه به دندانپزشک مشورت کنید و مجوز و دستورالعمل تمهیدات قبل و بعد از درمان دندانپزشکی را از او اخذ کنید.
6. شب قبل بهترین کار این است خواب کافی داشته باشید. یک ساعت قبل از مراجعه توصیه می‌شود درصورتی‌که منع مصرف از سوی پزشک یا حساسیتی ندارید از ایبوپروفن (مثلاً یک عدد قرص یا کپسول 400 میلی‌گرم) استفاده کنید. (اگر به هر دلیل از این دارو نمی‌توانید استفاده کنید درصورتی‌که منع مصرفی ندارید از استامینوفن استفاده کنید)
7. وعده غذایی قبل از مراجعه را متعادل بخورید. به‌هیچ‌وجه وعده غذایی را حذف نکنید. از پرخوری هم خودداری کنید. از مصرف هر نوع روان‌گردان و الکل هم 24 ساعت قبل از مراجعه به دندانپزشک خودداری کنید. (درصورتی‌که داروی روان‌گردان را پزشک تجویز کرده است قضیه فرق می‌کند و خودسرانه آن را قطع نکنید)
8. وقت حضور در محل را تنظیم کنید. ترافیک و پیدا کردن جای پارک توجیه خوبی برای دیر رسیدن نیستند. در ضمن زمان درمان شما ممکن است طولانی‌تر یا کوتاه‌تر از پیش‌بینی شما و حتی دندان پزشکتان باشد. لذا حتماً مدت‌زمانی بعد از خاتمه درمانی را هم که پیش‌بینی می‌کنید خالی بگذارید تا استرس نداشته باشید.
9. برای انجام درمان ریشه دندان معمول (عصب‌کشی) نیاز به همراه ندارید. (در مورد ” جراحی” ریشه حضور همراه ممکن است کمک‌کننده باشد) شما بعد از خاتمه کار نیاز به استراحت هم ندارید و حتی می‌توانید سر کار خود حاضر شوید. درصورتی‌که مایلید یک نفر می‌تواند تا اتاق انتظار شمارا همراهی کنید ولی حضور چند نفر به‌عنوان همراه مخصوصاً کودکان کم سن و سال، تنش و استرس بیشتری ایجاد خواهد کرد و آرامش مطب یا کلینیک را هم مختل می‌کند
</p>
                        <CustomButton className='buttonmodal' onClick={() => this.closeModal()}>بستن</CustomButton>
                    </div>
                </Modal>
            </div>
        );
    }
}
