import React, { Component } from 'react';
import Modal from 'react-awesome-modal';
import CustomButton from '../../custombutton/custombutton.component';

import '../Modal-asab/Modal-asab.styles.scss';

export default class ModalJarrahi extends Component {
    constructor(props) {
        super(props);
        this.state = {
            visible : false
        }
    }

    openModal() {
        this.setState({
            visible : true
        });
    }

    closeModal() {
        this.setState({
            visible : false
        });
    }

    render() {
        return (
            <div>
                <CustomButton className='buttonmodal' onClick={() => this.openModal()} >توضیحات بیشتر</CustomButton>
                <Modal visible={this.state.visible} width="1500" height="500" effect="fadeInUp" onClickAway={() => this.closeModal()}>
                    <div className='paracontainer'>
                        <h3>جراحی</h3>
                        <p className='paramodal'>
                        معرفی درمان جراحی لثه و مراقبت های بعدازآن                                                                                                                                              
دندانپزشک ممکن است بنا به دلایلی از جمله عدم رعایت بهداشت صحیح دهان و دندان و تحلیل لثه، بعد از انجام جرم گیری، اقدام به جراحی لثه نماید. در این جراحی، پس از کنار زدن لثه، جرم های زیر لثه را برداشته و سلول های بیمار استخوان را برمی دارد. سپس ناحیه عمل شستشو داده شده، به لثه فرم داده و به محل اولیه بخیه زده می شود. برای محافظت از لثه جراحی شده روی آن با خمیر مخصوص پانسمان می شود.
مراقبت های بعد از درمان
• تف نکنید و در صورت نیاز، آرام آب دهان را بیرون بریزید.
• از دستکاری پانسمان با دست، زبان و یا از مکیدن آن خودداری کنید.
• اولین روز بعد از جراحی استراحت کنید.
• داروی های خود را طبق دستور مصرف کنید.
• از مسکن های تجویز شده جهت تسکین درد استفاده کنید.
• از خوردن و آشامیدن نوشیدنی و مواد غذایی ترش مزه پرهیز نمایید.
• روز اول از غذاهای مایع و سرد استفاده کنید. از روز بعد، غذاهای نرم استفاده نموده و غذا را طرف دیگر که پانسمان ندارد بجوید.
• در روز اول از دهان شویه استفاده نکرده و مسواک نزنید.
• بعد از جراحی سیگار نکشید.
• به مدت چند روز، از انجام فعالیت های شدید بدنی و حمام گرم اجتناب کنید.
• ناحیه جراحی شده را از بیرون دهان، با استفاده از کیسه آب یخ، کمپرس سرد نمایید. (۱۰ دقیقه یکبار و به مدت چند دقیقه)
• از روز دوم به بعد، پس از هر غذا اول مسواک بزنید (بجز ناحیه جراحی شده) و سپس از دهان شویه (در صورت تجویز دندانپزشک) به ملایمت و بدون فشار استفاده نمایید.
• پس از برداشته شدن پانسمان و کشیدن بخیه‌ها، در روزهای اول دندان های ناحیه عمل شده را به آرامی و با احتیاط مسواک کنید و دقت نمایید که ضربه و فشار به لثه وارد نشود.
• جهت پیشگیری از ابتلای مجدد به بیماری لثه، رعایت بهداشت الزامی است.
• هر ۶ ماه یکبار جهت معاینات دوره ای به دندانپزشک مراجعه کنید.
• بعد از جراحی لثه، دندان ممکن است به تحریکات حرارتی، مقداری حساس شود که به مرور زمان کمتر شده و در نهایت از بین می رود.

 </p>
                        <CustomButton className='buttonmodal' onClick={() => this.closeModal()}>بستن</CustomButton>
                    </div>
                </Modal>
            </div>
        );
    }
}
