import React from 'react';

import './protocols.styles.scss';

export const Protocols = () => (
    <div className='protocolspage'>
        <div className='tosie'>
            <h2 className='hp'>
            مواردی که باید به دندانپزشک خود بگویید
            </h2>
            <p className='hp'>
            دندانپزشک شما باید در مورد شرایط شما و بیماری‌هایی که شما به آن مبتلا هستید، بداند! این دانستن چند دلیل دارد. اول اینکه بسیاری از بیماری‌هایی که مراجعین دندانپزشکی به آن‌ها مبتلا هستند می‌تواند روی درمان دندانپزشکی آن‌ها تأثیر بگذارد. از طرف دیگر سلامت دهان و سلامت عمومی بدن رابطه متقابلی باهم دارند. طوری که سلامت کلی بدن شما روی دهان شما تأثیر می‌گذارد و از طرف دیگر بیماری‌های دهان شما می‌توانند روی سلامت عمومی شما تأثیر داشته باشند.
برخی از افراد درمان‌های دندانپزشکی را ممکن است خیلی به‌عنوان «درمان» جدی ترقی نکنند و در مورد توضیحاتی که ممکن است در مورد درمان‌های قبلی پزشکی و داروهایی که مصرف می‌کنند به دندانپزشک خود کوتاهی کنند. درحالی‌که برخی از موارد تاریخچه پزشکی ممکن است مستقیماً روی درمان‌های دندانپزشکی تأثیر داشته باشد و حتی سلامت فرد را تهدید کند.
بسیاری از بیماری‌هایی که مبتلا می‌شویم، ممکن است علائم دهانی داشته باشند. در برخی از بیماری‌ها علائم دهانی جز اولین علائمی است که ظاهر می‌شود و تشخیص اولیه از روی علائم دهانی می‌تواند از بسیاری از آسیب‌های متعاقب پیشرفت بیماری جلوگیری کند.
به‌طورکلی بهتر است در مورد تمام جزئیات بیماری‌ها و داروهایی که مصرف می‌کنید، با دندانپزشک خود صحبت کنید. حتی برخی مکمل‌ها و داروهای گیاهی هم می‌توانند تداخل دارویی با داروهای تجویزشده توسط دندانپزشک شما داشته باشد..

            </p>
            <h3 className='hp'>
            بیماری‌های قلبی عروقی
            </h3>
            <p className='hp'>
            دندانپزشک شما باید در مورد تمام جوانب بیماری احتمالی قلبی عروقی و داروهای مصرفی شما اطلاع داشته باشد. تزریق انواعی از بی‌حسی دندانپزشکی در برخی از بیماران قلبی و عروقی می‌تواند مشکلاتی ایجاد کند. به‌علاوه در برخی از بیماران قلبی نیاز به‌پیش دارویی با آنتی‌بیوتیک قبل از برخی درمان‌های دندانپزشکی وجود دارد.داروهای قلبی و عروقی طیف وسیعی دارند.فشارخون در کشور ما به دلیل سبک ناسالم زندگی شایع است و به نظر در نسل‌های آینده هم روند افزایشی خواهد داشت. دندانپزشک شما در بسیاری از موارد مجبور است با پزشک متخصص قلبی که تحت نظرش هستید در مورد درمان دندانپزشکی شما مشورت بگیرد
            </p>
            <h3 className='hp'>
            مصرف داروها
            </h3>
            <p className='hp'>
            هر نوع دارویی را مصرف می‌کنید با دندانپزشک خود در میان بگذارید. شاید مصرف برخی داروها ازنظر شما عادی بوده و مهم نباشد. ولی ممکن است در درمان دندانپزشکی شما تأثیر داشته باشد. مثلاً مصرف آسپرین ساده که اغلب در برخی افراد مسن ممکن است مشاهده شود، ممکن است که در مواردی با عدم کنترل خونریزی در جریان درمان‌های دندانپزشکی همراه باشد.
            </p>
            <h3 className='hp'>
            بیماری‌های تنفسی و ریوی  
            </h3>
            <p className='hp'>
            در مورد آسم خود به دندانپزشک خود اطلاع دهید. در مورد سایر بیماری‌های تنفسی و علی‌الخصوص بیماری‌های مشکوک با منشأ عفونی (مانند سل) به دندانپزشک خود توضیحات کافی ارائه کنید.
            </p>
            <h3 className='hp'>
            عفونت‌های خونی، بیماری‌های مسری و بیماری‌های منتقله از راه جنسی
            </h3>
            <p className='hp'>
            امروزه خوشبختانه امکان درمان بیماران با عوامل مسری در بیشتر مراکز دندانپزشکی وجود دارد. در صورت ابتلا به هر نوع بیماری مسری از راه خون مانند ویروس عامل بیماری ایدز، هپاتیت و سایر بیماری‌های مسری مانند سل و … ، بدون واهمه با دندانپزشک خود در این رابطه صحبت کنید. آگاهی دندانپزشک در مورد این بیماری‌ها هم سلامت خود فرد، هم سایر مراجعین و هم کادر درمانی را تأمین می‌کند.
            </p>
            <h3 className='hp'>
            بارداری و شیردهی
            </h3>
            <p className='hp'>
            حتماً باید در مورد بارداری خود به دندانپزشک خود اطلاع دهید. شیردهی هم روی داروهای تجویزشده توسط دندانپزشک تأثیر می‌گذارد. تجویز رادیوگرافی، تصمیم به شروع درمان و داروها ، مواردی هستند که با دوره بارداری تحت تأثیر قرار می‌گیرند.
            </p>
            <h3 className='hp'>
            بیماری‌های کلیوی و کبدی
            </h3>
            <p className='hp'>
            دفع بسیاری از داروها از مسیرهای کلیوی و کبدی صورت می‌گیرد. برخی داروهای رایج در تجویزهای دندانپزشکی ممکن است به دلیل ابتلا به بیماری کلیوی یا کبدی تغییر داده شوند، منع تجویز داشته باشند یا نحوه مصرف آن‌ها تغییر دهد
            </p>
            <h3 className='hp'>
            بیماری‌های اندوکرین و هورمونال
            </h3>
            <p className='hp'>
            اختلالات هورمونال متنوع هستند و ممکن است روی درمان‌های دندانپزشکی تأثیر بگذارند. برای مثال اختلالات تیروئیدی می‌توانند با مشکلاتی در کنترل فشارخون همراه باشد. دانستن این نکات به دندانپزشک شما کمک می‌کند که نظارت بهتری روی سلامتی شما داشته باشد. در مورد مصرف داروهای هورمونی و حتی داروهای ضدبارداری هم دندانپزشک خود را مطلع کنید. برخی از داروهایی که دندانپزشک برای شما ممکن است تجویز کند، در اثر داروهای ضدبارداری اختلال احتمال دارد ایجاد کند
            </p>
            <h3 className='hp'>
            سابقه تصادف، ضربه، سکته مغزی یا قلبی یا افسردگی
            </h3>
            <p className='hp'>
            تصادفات و ضربات واردشده به دندان‌ها می‌تواند بر سرنوشت دندان‌ها تأثیر بگذارد. ضربه( تروما) می‌تواند باعث از دست رفتن دندان‌ها در کوتاه‌مدت و بلندمدت بشود. کسانی که سابقه سکته مغزی دارند معمولاً داروهایی می‌خورند که حتماً باید در مورد آن‌ها، دندانپزشک خود را مطلع کنند. در مورد افسردگی هم، دندانپزشک خود را از داروهایی که می‌خورید مطلع کنید
            </p>
            <h3 className='hp'>
            ناتوانی‌ها و معلولیت‌ها
            </h3>
            <p className='hp'>
            ممکن است شما دوست نداشته باشید در مورد برخی از ناتوانی‌های جسمی خود یا ناتوانی جسمی یا ذهنی اطرافیان خود با دندانپزشک خود صحبت کنید. بعضی از ناتوانی‌های جسمی ممکن است که ایجاب کنند بیمار روی موقعیت خاصی روی یونیت قرار بگیرد اگر مشکل کمر یا گردن دارید، اگر جراحی خاصی روی حرکت و نشستن شما تأثیر گذاشته است و یا اگر فرزند یا کسی که قیم او هستید معلولیت ذهنی دارد در مورد جزئیات آن‌ها با دندانپزشک خود صحبت کنید.
            </p>
            <h3 className='hp'>
            سابقه سرطان، شیمی‌درمانی یا اشعه درمانی
            </h3>
            <p className='hp'>
            در مورد بیماری سرطان با دندانپزشک خود صحبت کنید. حتی اگر بیماری شما در سال‌های قبل درمان شده است هم ،آن را با دندانپزشک خود در میان بگذارید.ممکن است اقدام به شیمی‌درمانی یا اشعه درمانی، نوع درمان شمارا تغییر دهد. به‌علاوه ممکن است تمهیدات خاصی برای انجام درمان شما در نظر گرفته شود
            </p>
            <h3 className='hp'>
            مصرف داروهای گیاهی و درمان هامیوپاتی
            </h3>
            <p className='hp'>
            داروهای گیاهی به‌هرحال دارو هستند و تداخل با سایر داروها ممکن است داشته باشند. مصرف این داروها را در توضیح تاریخچه پزشکی خود به دندانپزشک فراموش نکنید. در مورد اثرات درمان هامیوپاتی اطلاعات علمی موثقی وجود ندارد. ولی بسیاری از کسانی که این درمان‌ها را تبلیغ می‌کنند بیماران را از مصرف خیلی از داروها به درست یا نادرست منع می‌کنند و درصورتی‌که شما می‌خواهید درمان ارائه‌شده توسط آن‌ها را ادامه دهید، باید به توصیه‌های درمانگر خود عمل کنید و با کمک دندانپزشک خود در مورد نحوه انجام دندانپزشکی خود تصمیم اتخاذ نمایید
            </p>
        </div>
    </div>
);