import React, { Component } from 'react';
import Modal from 'react-awesome-modal';
import CustomButton from '../../custombutton/custombutton.component';

import '../Modal-asab/Modal-asab.styles.scss';

export default class ModalJerm extends Component {
    constructor(props) {
        super(props);
        this.state = {
            visible : false
        }
    }

    openModal() {
        this.setState({
            visible : true
        });
    }

    closeModal() {
        this.setState({
            visible : false
        });
    }

    render() {
        return (
            <div>
                <CustomButton className='buttonmodal' onClick={() => this.openModal()} >توضیحات بیشتر</CustomButton>
                <Modal visible={this.state.visible} width="1500" height="700" effect="fadeInUp" onClickAway={() => this.closeModal()}>
                    <div className='paracontainer'>
                        <h3>جرم گیری</h3>
                        <li className='limodal'>
                      	در روش جرمگیری دندان، جرمهای روی دندان و لثه و رنگدانه‌های خارجی از روی دندانها برداشته می‌شود.
                        </li>
                        <li className='limodal'>
                     اگر فردی در مصرف چای زیاده روی کند و یا سیگاری باشد و رنگدانه های ایجاد شده روی دندان وی زیاد باشد با انجام جرمگیری تفاوت چشمگیری ایجاد می‌شود.
                        </li>
                        <li className='limodal'>
                      	در انجام جرمگیری دندان رنگ خود دندان تغییری نمیکند یعنی روشنتر نمی‌شود بلکه فقط پلاکها و رنگدانه‌های روی دندان برداشته می‌شود و در نهایت رنگ واقعی دندان نمایان خواهد شد.
                        </li>
                        <h3>
                        بلیچینگ
                        </h3>
                        <p className='paramodal'>
                        یکی از درمان های دندانپزشک زیبایی بلیچینگ می باشد که در راستای سفید کردن دندان انجام می شود.
                         بلیچینگ که دارای دو درمان خانگی و مطب می باشد باعث سفیدی دندان  ها می شود این روش یکی از ارزان ترین تکنیک های سفید کردن دندان است. یکی از 
                         پر تقاضاترین خدمات زیبایی دندانپزشکی روشن کردن رنگ دندان های تیره، زرد یا قهوه ای می باشد.
                        </p>
                        <h5>تفاوت بلیچینگ و جرمگیری دندان چیست؟</h5>
                        <p className='paramodal'>
                            

 هر دو روش جرمگیری و بلیچینگ دندان باعث روشن تر شدن دندان‌ها می‌شود ولی در هر کدام از این روشها نوع و میزان سفید کردن دندانها متفاوت است. روش جرمگیری یا (اولتراسونیک) باعث پاکسازی دندانها از املاح رسوب کرده که باعث بوی بد دهان، بدرنگی و زبری دندانها می‌شود. خود بزاق دهان انسان به طور طبیعی با میکروبها و مواد غذایی و باکتریهای دهان ترکیب شده و ایجاد لایه‌‌ای به نام پلاک بر روی دندانها می‌کند. اصولاً پلاکها در قسمتهای پایینی لثه و نواحی که دسترسی به آنها برای تمیز کردن دشوار است بیشتر میشوند که به مرور زمان باعث پوسیدگی دندان می‌شوند پس برای از بین بردن این پلاکهای ایجاد شده باید جرمگیری دندان انجام شود که طی این فرآیند پلاکها و رسوباتی که در بین دندان و لثه ها ایجاد شده از بین می‌رود که همین امر گاهی سبب روشنتر شدن لثه و دندان افراد می‌شود.
روش بلیچینگ دندان صرفا یک روش برای سفید کردن دندانهاست. بلیچینگ دندان در واقع راه درمانسیت برای از بین بردن لکه ها و رنگدانه های روی دندان که در اثر مرور زمان و به صورت ژنتیکی به وجود آمده این روش صرفاً برای زیبایی است و روش درمانی ای نیست. بلیچینگ دندان یکی از بهترین و کم آسیب ترین روشهای سفید کردن دندان است.

                        </p>
                        <CustomButton className='buttonmodal' onClick={() => this.closeModal()}>بستن</CustomButton>
                    </div>
                </Modal>
            </div>
        );
    }
}
