import React from 'react';

import './covid.styles.scss';

export const Covid = () =>  (
    <div className='covidcontainer'>
        <h3 className='para'>در شرایط کرونایی فعلی، آیا به دندانپزشکی برویم؟</h3>
        <p className='para'>با وضعیت پیش آمده و گسترش سریع بیماری کرونا که به سمت جهانی شدن یا پاندمی پیش می‌رود و
             با توجه به اینکه نیاز به درمان دندانپزشکی ممکن است وجود داشته باشد بر آن شدیم احتمال انتقال بیماری و 
             اصول پیشگیری در مطب دندانپزشکی را بررسی کنیم. با توجه به اینکه بهترین راه مقابله با
              بیماری و قطع سیکل انتقال، ماندن در خانه است. اولین ریسک ابتلا، ناشی از خروج از منزل
              به منظور مراجعه به دندانپزشک می باشد و همچنین با توجه به فضای بسته مطب‌ها
              و احتمال حضور افراد دیگر احتمال انتقال بیماری در محیط مطب نیز بسیار بالا می باشد
        </p>
        <h4 className='para'>
        راه حل چیست؟
        </h4>
        <p className='para'>
        بجز در موارد اورژانس واقعی و نیازمند مداخله از مراجعه حضوری اجتناب کنید در صورت وجود علایم ملایم تا متوسط دندانی بهتر است به مشاوره تلفنی اکتفا نموده و توصیه های دندانپزشک را انجام دهید. موارد اورژانس واقعی دندانپزشکی خوشبختانه بسیار محدود می‌باشد به عنوان مثال عفونت و تورم گسترده و پیشرونده که باعث ایجاد تب و بی‌حالی شده باشد و درد شدید که به مسکن معمولی (مثل ژلوفن) پاسخ ندهد و زندگی فرد را مختل کرده باشد.
        </p>
        <h5 className='para'>
        :بجز در موارد فوق به هیچ وجه جهت انجام درمان‌های روتین و غیراورژانسی مانند موارد زیر به دندانپزشک مراجعه نکنید
        </h5>
        <li>درمان زیبایی</li>
        <li>جراحی های غیراورژانس لثه</li>
        <li>یمپلنت</li>
        <li>دندان عقل</li>
        <li>ترمیم ساده دندان‌ها</li>
        <li>روکش</li>
        <li>دندان مصنوعی</li>
        <li>ارتودنسی</li>
    </div>
);